app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 33]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4, $5, $6, $7)  [["id", 17], ["id", 15], ["id", 16], ["id", 20], ["id", 11], ["id", 12], ["id", 14]]
---
  def show
    @post = Post.find(params[:id])
    @comments = @post.comments.includes(:user)